* GISP2
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | GISP2
Place name                       | GISP2
Geographic location              | Central Greenland
Ice type                         | Ice sheet
Data Source                      | Clow email
Data DOI                         | 
Science Source                   | Cuffey, K. M., Clow, G. D., Alley, R. B., Stuiver, M., Waddington, E. D., & Saltus, R. W. (1995). Large arctic temperature change at the Wisconsin-Holocene glacial transition. Science, 270(5235), 455-458.
Science DOI                      | 10.1002/2014JF003418
Date                             | 1996-06-02
Longitude [°E]                   | -38.4667
Latitude [°N]                    | 72.5833
Location Source                  | 10.5194/essd-2021-290
Depth of top measurement [m]     | 73.0
Depth of bottom measurement [m]  | 3053
Ice thickness [m]                | 3053
Coverage [% of thickness]        | 98
Ice thickness source             | https://en.wikipedia.org/wiki/List_of_ice_cores#Greenland
Note                             | Ice thickness from data does not match ice thickness from Vinther (2008); Location approximate; See also Table 1 of MacGregor, J., J. Li, J. Paden et al. 2015. Radar attenuation and temperature within the Greenland Ice Sheet. Journal of Geophysical Research. 120: 983-1008. 
#+end_example

** Temperature

+ Data provided by 3rd party email:

#+BEGIN_example
From: Gary D Clow
To: Ken Mankoff, William Colgan
Subject: GISP2-D temperature log
Date: Mon 01 Mar 2021 09:12:58 AM PST
Attachments: [1]GISP2-D-3_96JUN02.txt(14.4K),
 [2]GISP2-D_Tz.jpg(313.2K), [3]GISP2_dTdz.jpg(325.4K)

Attached is the temperature log acquired in the main GISP2 borehole by the
USGS temperature logging system on 2 June 1996.  The attached log has been
denoised to remove instrumental noise and deconvolved to account for the
motion of the sensor while logging.  The log has not been corrected for
borehole refraction effects or the thermal disturbance caused by drilling.
The onset of fluid convection occurs at about 1600 m; convection becomes
fully turbulent below ~2300 m. No corrections have been applied to account
for the effects of borehole fluid convection.
#+END_example

** Thickness

+ See also [[citet:cuffey_1992][Cuffey (1992)]] referring to Hodge et al., 1990.
 
** Location

** Data                                                 :noexport:

#+BEGIN_SRC python :results none
import numpy as np
import pandas as pd

df = pd.read_csv('GISP2-D-3_96JUN02.txt', sep=' ', skipinitialspace=True, skiprows=24, names=['d','t'], index_col=0)
df.index.name = 'd'
df.to_csv('data.csv')
#+END_SRC

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|       d |        t |
|   72.61 | -31.4118 |
|    75.0 | -31.4139 |
|    80.0 | -31.4197 |
|    85.0 | -31.4264 |
|    90.0 |  -31.433 |
|    95.0 | -31.4387 |
|   100.0 | -31.4441 |
|   105.0 | -31.4493 |
|   110.0 | -31.4545 |
|   115.0 | -31.4591 |
|   120.0 |  -31.463 |
|   125.0 | -31.4662 |
|   130.0 | -31.4687 |
|   135.0 | -31.4704 |
|   140.0 | -31.4712 |
|   145.0 | -31.4712 |
|   150.0 | -31.4704 |
|   155.0 | -31.4689 |
|   160.0 | -31.4666 |
|   165.0 | -31.4636 |
|   170.0 | -31.4598 |
|   175.0 | -31.4554 |
|   180.0 | -31.4504 |
|   185.0 | -31.4448 |
|   190.0 | -31.4387 |
|   195.0 | -31.4322 |
|   200.0 | -31.4254 |
|   205.0 | -31.4182 |
|   210.0 | -31.4107 |
|   215.0 | -31.4028 |
|   220.0 | -31.3946 |
|   225.0 | -31.3863 |
|   230.0 |  -31.378 |
|   235.0 | -31.3698 |
|   240.0 | -31.3614 |
|   245.0 | -31.3528 |
|   250.0 | -31.3442 |
|   255.0 | -31.3356 |
|   260.0 | -31.3271 |
|   265.0 | -31.3188 |
|   270.0 | -31.3105 |
|   275.0 | -31.3022 |
|   280.0 |  -31.294 |
|   285.0 | -31.2859 |
|   290.0 | -31.2778 |
|   295.0 | -31.2698 |
|   300.0 | -31.2619 |
|   305.0 | -31.2541 |
|   310.0 | -31.2465 |
|   315.0 | -31.2389 |
|   320.0 | -31.2315 |
|   325.0 |  -31.224 |
|   330.0 | -31.2167 |
|   335.0 | -31.2095 |
|   340.0 | -31.2025 |
|   345.0 | -31.1957 |
|   350.0 | -31.1889 |
|   355.0 | -31.1824 |
|   360.0 | -31.1759 |
|   365.0 | -31.1696 |
|   370.0 | -31.1635 |
|   375.0 | -31.1574 |
|   380.0 | -31.1516 |
|   385.0 | -31.1458 |
|   390.0 | -31.1403 |
|   395.0 | -31.1349 |
|   400.0 | -31.1295 |
|   405.0 | -31.1244 |
|   410.0 | -31.1194 |
|   415.0 | -31.1145 |
|   420.0 | -31.1097 |
|   425.0 | -31.1051 |
|   430.0 | -31.1007 |
|   435.0 | -31.0964 |
|   440.0 | -31.0922 |
|   445.0 | -31.0882 |
|   450.0 | -31.0843 |
|   455.0 | -31.0805 |
|   460.0 | -31.0769 |
|   465.0 | -31.0735 |
|   470.0 | -31.0701 |
|   475.0 | -31.0668 |
|   480.0 | -31.0638 |
|   485.0 | -31.0608 |
|   490.0 | -31.0581 |
|   495.0 | -31.0555 |
|   500.0 | -31.0531 |
|   505.0 | -31.0507 |
|   510.0 | -31.0486 |
|   515.0 | -31.0465 |
|   520.0 | -31.0447 |
|   525.0 |  -31.043 |
|   530.0 | -31.0414 |
|   535.0 | -31.0399 |
|   540.0 | -31.0386 |
|   545.0 | -31.0374 |
|   550.0 | -31.0364 |
|   555.0 | -31.0355 |
|   560.0 | -31.0347 |
|   565.0 | -31.0341 |
|   570.0 | -31.0336 |
|   575.0 | -31.0332 |
|   580.0 | -31.0329 |
|   585.0 | -31.0328 |
|   590.0 | -31.0328 |
|   595.0 | -31.0329 |
|   600.0 | -31.0332 |
|   605.0 | -31.0335 |
|   610.0 |  -31.034 |
|   615.0 | -31.0346 |
|   620.0 | -31.0354 |
|   625.0 | -31.0363 |
|   630.0 | -31.0373 |
|   635.0 | -31.0384 |
|   640.0 | -31.0396 |
|   645.0 |  -31.041 |
|   650.0 | -31.0425 |
|   655.0 | -31.0441 |
|   660.0 | -31.0459 |
|   665.0 | -31.0478 |
|   670.0 | -31.0498 |
|   675.0 | -31.0519 |
|   680.0 | -31.0542 |
|   685.0 | -31.0565 |
|   690.0 |  -31.059 |
|   695.0 | -31.0616 |
|   700.0 | -31.0644 |
|   705.0 | -31.0672 |
|   710.0 | -31.0702 |
|   715.0 | -31.0733 |
|   720.0 | -31.0765 |
|   725.0 | -31.0798 |
|   730.0 | -31.0833 |
|   735.0 | -31.0868 |
|   740.0 | -31.0905 |
|   745.0 | -31.0943 |
|   750.0 | -31.0983 |
|   755.0 | -31.1023 |
|   760.0 | -31.1065 |
|   765.0 | -31.1108 |
|   770.0 | -31.1151 |
|   775.0 | -31.1196 |
|   780.0 | -31.1242 |
|   785.0 |  -31.129 |
|   790.0 | -31.1338 |
|   795.0 | -31.1387 |
|   800.0 | -31.1438 |
|   805.0 | -31.1489 |
|   810.0 | -31.1542 |
|   815.0 | -31.1597 |
|   820.0 | -31.1652 |
|   825.0 | -31.1708 |
|   830.0 | -31.1765 |
|   835.0 | -31.1823 |
|   840.0 | -31.1882 |
|   845.0 | -31.1942 |
|   850.0 | -31.2004 |
|   855.0 | -31.2066 |
|   860.0 |  -31.213 |
|   865.0 | -31.2194 |
|   870.0 |  -31.226 |
|   875.0 | -31.2326 |
|   880.0 | -31.2394 |
|   885.0 | -31.2462 |
|   890.0 |  -31.253 |
|   895.0 |   -31.26 |
|   900.0 | -31.2672 |
|   905.0 | -31.2744 |
|   910.0 | -31.2816 |
|   915.0 |  -31.289 |
|   920.0 | -31.2964 |
|   925.0 | -31.3039 |
|   930.0 | -31.3115 |
|   935.0 | -31.3192 |
|   940.0 | -31.3271 |
|   945.0 | -31.3352 |
|   950.0 | -31.3432 |
|   955.0 | -31.3513 |
|   960.0 | -31.3594 |
|   965.0 | -31.3675 |
|   970.0 | -31.3758 |
|   975.0 |  -31.384 |
|   980.0 | -31.3924 |
|   985.0 | -31.4008 |
|   990.0 | -31.4093 |
|   995.0 | -31.4178 |
|  1000.0 | -31.4264 |
|  1005.0 | -31.4351 |
|  1010.0 | -31.4438 |
|  1015.0 | -31.4526 |
|  1020.0 | -31.4614 |
|  1025.0 | -31.4703 |
|  1030.0 | -31.4792 |
|  1035.0 | -31.4882 |
|  1040.0 | -31.4973 |
|  1045.0 | -31.5064 |
|  1050.0 | -31.5154 |
|  1055.0 | -31.5246 |
|  1060.0 | -31.5337 |
|  1065.0 |  -31.543 |
|  1070.0 | -31.5523 |
|  1075.0 | -31.5616 |
|  1080.0 | -31.5709 |
|  1085.0 | -31.5802 |
|  1090.0 | -31.5894 |
|  1095.0 | -31.5987 |
|  1100.0 | -31.6079 |
|  1105.0 | -31.6172 |
|  1110.0 | -31.6268 |
|  1115.0 | -31.6364 |
|  1120.0 |  -31.646 |
|  1125.0 | -31.6554 |
|  1130.0 | -31.6648 |
|  1135.0 | -31.6742 |
|  1140.0 | -31.6835 |
|  1145.0 | -31.6928 |
|  1150.0 | -31.7023 |
|  1155.0 | -31.7117 |
|  1160.0 | -31.7211 |
|  1165.0 | -31.7304 |
|  1170.0 | -31.7397 |
|  1175.0 |  -31.749 |
|  1180.0 | -31.7583 |
|  1185.0 | -31.7676 |
|  1190.0 | -31.7768 |
|  1195.0 | -31.7859 |
|  1200.0 | -31.7951 |
|  1205.0 | -31.8041 |
|  1210.0 | -31.8132 |
|  1215.0 | -31.8222 |
|  1220.0 | -31.8312 |
|  1225.0 | -31.8401 |
|  1230.0 |  -31.849 |
|  1235.0 | -31.8577 |
|  1240.0 | -31.8664 |
|  1245.0 | -31.8749 |
|  1250.0 | -31.8834 |
|  1255.0 | -31.8918 |
|  1260.0 | -31.9003 |
|  1265.0 | -31.9087 |
|  1270.0 | -31.9171 |
|  1275.0 | -31.9253 |
|  1280.0 | -31.9334 |
|  1285.0 | -31.9414 |
|  1290.0 | -31.9491 |
|  1295.0 | -31.9568 |
|  1300.0 | -31.9643 |
|  1305.0 |  -31.972 |
|  1310.0 | -31.9795 |
|  1315.0 | -31.9869 |
|  1320.0 | -31.9939 |
|  1325.0 | -32.0009 |
|  1330.0 | -32.0079 |
|  1335.0 | -32.0148 |
|  1340.0 | -32.0215 |
|  1345.0 | -32.0279 |
|  1350.0 | -32.0341 |
|  1355.0 | -32.0402 |
|  1360.0 | -32.0463 |
|  1365.0 | -32.0523 |
|  1370.0 |  -32.058 |
|  1375.0 | -32.0634 |
|  1380.0 | -32.0687 |
|  1385.0 | -32.0739 |
|  1390.0 |  -32.079 |
|  1395.0 | -32.0839 |
|  1400.0 | -32.0885 |
|  1405.0 | -32.0929 |
|  1410.0 | -32.0971 |
|  1415.0 | -32.1012 |
|  1420.0 | -32.1051 |
|  1425.0 | -32.1087 |
|  1430.0 |  -32.112 |
|  1435.0 | -32.1152 |
|  1440.0 | -32.1181 |
|  1445.0 | -32.1207 |
|  1450.0 | -32.1232 |
|  1455.0 | -32.1254 |
|  1460.0 | -32.1275 |
|  1465.0 | -32.1292 |
|  1470.0 | -32.1307 |
|  1475.0 | -32.1319 |
|  1480.0 | -32.1329 |
|  1485.0 | -32.1337 |
|  1490.0 | -32.1342 |
|  1495.0 | -32.1345 |
|  1500.0 | -32.1344 |
|  1505.0 | -32.1341 |
|  1510.0 | -32.1335 |
|  1515.0 | -32.1325 |
|  1520.0 | -32.1313 |
|  1525.0 | -32.1297 |
|  1530.0 | -32.1279 |
|  1535.0 | -32.1258 |
|  1540.0 | -32.1233 |
|  1545.0 | -32.1205 |
|  1550.0 | -32.1174 |
|  1555.0 |  -32.114 |
|  1560.0 | -32.1103 |
|  1565.0 | -32.1062 |
|  1570.0 | -32.1018 |
|  1575.0 | -32.0971 |
|  1580.0 |  -32.092 |
|  1585.0 | -32.0866 |
|  1590.0 | -32.0806 |
|  1595.0 | -32.0743 |
|  1600.0 | -32.0676 |
|  1605.0 | -32.0606 |
|  1610.0 | -32.0534 |
|  1615.0 | -32.0462 |
|  1620.0 | -32.0388 |
|  1625.0 | -32.0309 |
|  1630.0 | -32.0221 |
|  1635.0 | -32.0126 |
|  1640.0 | -32.0028 |
|  1645.0 | -31.9932 |
|  1650.0 | -31.9831 |
|  1655.0 | -31.9723 |
|  1660.0 | -31.9609 |
|  1665.0 |  -31.949 |
|  1670.0 | -31.9368 |
|  1675.0 | -31.9243 |
|  1680.0 | -31.9115 |
|  1685.0 | -31.8981 |
|  1690.0 | -31.8844 |
|  1695.0 | -31.8704 |
|  1700.0 | -31.8562 |
|  1705.0 | -31.8414 |
|  1710.0 | -31.8256 |
|  1715.0 | -31.8092 |
|  1720.0 | -31.7924 |
|  1725.0 | -31.7753 |
|  1730.0 | -31.7579 |
|  1735.0 | -31.7401 |
|  1740.0 | -31.7219 |
|  1745.0 | -31.7031 |
|  1750.0 | -31.6837 |
|  1755.0 | -31.6637 |
|  1760.0 | -31.6433 |
|  1765.0 | -31.6225 |
|  1770.0 | -31.6012 |
|  1775.0 | -31.5791 |
|  1780.0 | -31.5564 |
|  1785.0 | -31.5333 |
|  1790.0 | -31.5098 |
|  1795.0 | -31.4859 |
|  1800.0 | -31.4616 |
|  1805.0 | -31.4367 |
|  1810.0 | -31.4114 |
|  1815.0 | -31.3855 |
|  1820.0 | -31.3592 |
|  1825.0 | -31.3322 |
|  1830.0 | -31.3048 |
|  1835.0 | -31.2769 |
|  1840.0 | -31.2482 |
|  1845.0 | -31.2186 |
|  1850.0 | -31.1886 |
|  1855.0 | -31.1582 |
|  1860.0 | -31.1273 |
|  1865.0 | -31.0962 |
|  1870.0 | -31.0642 |
|  1875.0 | -31.0318 |
|  1880.0 | -30.9984 |
|  1885.0 | -30.9642 |
|  1890.0 | -30.9299 |
|  1895.0 | -30.8955 |
|  1900.0 | -30.8605 |
|  1905.0 | -30.8243 |
|  1910.0 | -30.7871 |
|  1915.0 | -30.7494 |
|  1920.0 | -30.7117 |
|  1925.0 | -30.6733 |
|  1930.0 | -30.6343 |
|  1935.0 | -30.5948 |
|  1940.0 | -30.5546 |
|  1945.0 | -30.5136 |
|  1950.0 | -30.4723 |
|  1955.0 |   -30.43 |
|  1960.0 |  -30.387 |
|  1965.0 | -30.3432 |
|  1970.0 | -30.3001 |
|  1975.0 |  -30.257 |
|  1980.0 | -30.2127 |
|  1985.0 | -30.1667 |
|  1990.0 |   -30.12 |
|  1995.0 | -30.0731 |
|  2000.0 | -30.0257 |
|  2005.0 |  -29.978 |
|  2010.0 | -29.9294 |
|  2015.0 | -29.8801 |
|  2020.0 | -29.8295 |
|  2025.0 |  -29.778 |
|  2030.0 | -29.7278 |
|  2035.0 |  -29.676 |
|  2040.0 | -29.6222 |
|  2045.0 | -29.5679 |
|  2050.0 | -29.5138 |
|  2055.0 | -29.4601 |
|  2060.0 | -29.4055 |
|  2065.0 | -29.3505 |
|  2070.0 | -29.2946 |
|  2075.0 | -29.2385 |
|  2080.0 | -29.1821 |
|  2085.0 | -29.1248 |
|  2090.0 | -29.0659 |
|  2095.0 | -29.0059 |
|  2100.0 | -28.9451 |
|  2105.0 | -28.8848 |
|  2110.0 | -28.8241 |
|  2115.0 | -28.7626 |
|  2120.0 | -28.6996 |
|  2125.0 | -28.6361 |
|  2130.0 | -28.5724 |
|  2135.0 | -28.5088 |
|  2140.0 | -28.4445 |
|  2145.0 |  -28.379 |
|  2150.0 | -28.3125 |
|  2155.0 | -28.2455 |
|  2160.0 | -28.1778 |
|  2165.0 | -28.1094 |
|  2170.0 | -28.0406 |
|  2175.0 | -27.9712 |
|  2180.0 | -27.9011 |
|  2185.0 | -27.8307 |
|  2190.0 |   -27.76 |
|  2195.0 | -27.6886 |
|  2200.0 | -27.6162 |
|  2205.0 | -27.5431 |
|  2210.0 | -27.4694 |
|  2215.0 | -27.3953 |
|  2220.0 | -27.3211 |
|  2225.0 | -27.2466 |
|  2230.0 | -27.1708 |
|  2235.0 | -27.0948 |
|  2240.0 | -27.0175 |
|  2245.0 | -26.9392 |
|  2250.0 | -26.8601 |
|  2255.0 | -26.7809 |
|  2260.0 | -26.7017 |
|  2265.0 | -26.6218 |
|  2270.0 | -26.5413 |
|  2275.0 | -26.4602 |
|  2280.0 | -26.3785 |
|  2285.0 | -26.2956 |
|  2290.0 | -26.2126 |
|  2295.0 | -26.1288 |
|  2300.0 | -26.0445 |
|  2305.0 | -25.9603 |
|  2310.0 | -25.8762 |
|  2315.0 |  -25.792 |
|  2320.0 | -25.7061 |
|  2325.0 | -25.6175 |
|  2330.0 |  -25.528 |
|  2335.0 | -25.4393 |
|  2340.0 | -25.3513 |
|  2345.0 | -25.2628 |
|  2350.0 | -25.1733 |
|  2355.0 | -25.0833 |
|  2360.0 | -24.9927 |
|  2365.0 | -24.9026 |
|  2370.0 | -24.8119 |
|  2375.0 | -24.7195 |
|  2380.0 | -24.6253 |
|  2385.0 | -24.5311 |
|  2390.0 | -24.4382 |
|  2395.0 | -24.3457 |
|  2400.0 | -24.2522 |
|  2405.0 | -24.1561 |
|  2410.0 | -24.0598 |
|  2415.0 | -23.9631 |
|  2420.0 | -23.8668 |
|  2425.0 | -23.7699 |
|  2430.0 | -23.6723 |
|  2435.0 | -23.5743 |
|  2440.0 | -23.4758 |
|  2445.0 | -23.3766 |
|  2450.0 | -23.2768 |
|  2455.0 | -23.1764 |
|  2460.0 | -23.0754 |
|  2465.0 | -22.9745 |
|  2470.0 | -22.8739 |
|  2475.0 | -22.7737 |
|  2480.0 | -22.6728 |
|  2485.0 | -22.5709 |
|  2490.0 | -22.4684 |
|  2495.0 | -22.3647 |
|  2500.0 | -22.2601 |
|  2505.0 |  -22.155 |
|  2510.0 | -22.0507 |
|  2515.0 | -21.9467 |
|  2520.0 | -21.8419 |
|  2525.0 | -21.7358 |
|  2530.0 | -21.6294 |
|  2535.0 | -21.5245 |
|  2540.0 | -21.4202 |
|  2545.0 | -21.3146 |
|  2550.0 | -21.2061 |
|  2555.0 | -21.0966 |
|  2560.0 | -20.9874 |
|  2565.0 | -20.8789 |
|  2570.0 | -20.7704 |
|  2575.0 | -20.6619 |
|  2580.0 | -20.5537 |
|  2585.0 |  -20.445 |
|  2590.0 | -20.3348 |
|  2595.0 | -20.2234 |
|  2600.0 | -20.1123 |
|  2605.0 | -20.0005 |
|  2610.0 | -19.8892 |
|  2615.0 | -19.7789 |
|  2620.0 | -19.6691 |
|  2625.0 | -19.5568 |
|  2630.0 |  -19.442 |
|  2635.0 | -19.3274 |
|  2640.0 | -19.2144 |
|  2645.0 | -19.1021 |
|  2650.0 | -18.9892 |
|  2655.0 | -18.8751 |
|  2660.0 | -18.7608 |
|  2665.0 | -18.6466 |
|  2670.0 | -18.5317 |
|  2675.0 | -18.4175 |
|  2680.0 | -18.3028 |
|  2685.0 |  -18.188 |
|  2690.0 | -18.0721 |
|  2695.0 | -17.9552 |
|  2700.0 | -17.8387 |
|  2705.0 | -17.7227 |
|  2710.0 | -17.6069 |
|  2715.0 | -17.4909 |
|  2720.0 | -17.3748 |
|  2725.0 | -17.2582 |
|  2730.0 | -17.1395 |
|  2735.0 | -17.0199 |
|  2740.0 | -16.9006 |
|  2745.0 | -16.7827 |
|  2750.0 | -16.6648 |
|  2755.0 | -16.5467 |
|  2760.0 | -16.4282 |
|  2765.0 | -16.3094 |
|  2770.0 |   -16.19 |
|  2775.0 |  -16.071 |
|  2780.0 | -15.9509 |
|  2785.0 | -15.8312 |
|  2790.0 | -15.7111 |
|  2795.0 | -15.5911 |
|  2800.0 | -15.4711 |
|  2805.0 | -15.3511 |
|  2810.0 | -15.2308 |
|  2815.0 | -15.1102 |
|  2820.0 | -14.9889 |
|  2825.0 | -14.8671 |
|  2830.0 | -14.7458 |
|  2835.0 | -14.6254 |
|  2840.0 | -14.5047 |
|  2845.0 | -14.3823 |
|  2850.0 | -14.2587 |
|  2855.0 | -14.1357 |
|  2860.0 | -14.0141 |
|  2865.0 | -13.8928 |
|  2870.0 | -13.7713 |
|  2875.0 | -13.6498 |
|  2880.0 | -13.5275 |
|  2885.0 | -13.4046 |
|  2890.0 | -13.2818 |
|  2895.0 | -13.1599 |
|  2900.0 | -13.0388 |
|  2905.0 |  -12.917 |
|  2910.0 | -12.7942 |
|  2915.0 | -12.6723 |
|  2920.0 | -12.5502 |
|  2925.0 | -12.4282 |
|  2930.0 | -12.3057 |
|  2935.0 | -12.1827 |
|  2940.0 | -12.0599 |
|  2945.0 |  -11.936 |
|  2950.0 | -11.8125 |
|  2955.0 | -11.6896 |
|  2960.0 | -11.5681 |
|  2965.0 | -11.4461 |
|  2970.0 | -11.3225 |
|  2975.0 |  -11.197 |
|  2980.0 | -11.0732 |
|  2985.0 | -10.9513 |
|  2990.0 | -10.8296 |
|  2995.0 | -10.7056 |
|  3000.0 | -10.5812 |
|  3005.0 | -10.4575 |
|  3010.0 | -10.3352 |
|  3015.0 | -10.2129 |
|  3020.0 | -10.0899 |
|  3025.0 |  -9.9671 |
|  3030.0 |  -9.8438 |
|  3035.0 |  -9.7209 |
|  3040.0 |  -9.5989 |
|  3045.0 |   -9.479 |
|  3050.0 |  -9.3606 |
| 3053.15 |   -9.286 |
